# Библиотека pandas - part II

In [26]:
#загрузка библиотеки
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('2_bookings.csv', sep = ';', parse_dates = ['arrival full date'])
df.head(2)

,Hotel,Is Canceled,Lead Time,arrival full date,Arrival Date Year,Arrival Date Month,Arrival Date Week Number,Arrival Date Day of Month,Stays in Weekend nights,Stays in week nights,...,Adults,Children,Babies,Meal,Country,Reserved Room Type,Assigned room type,customer type,Reservation Status,Reservation status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01

In [68]:
df = df.rename(columns=lambda c: c.lower().replace('-', '_').replace('/', '_').replace(' ', '_'))
df.head(3)

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02

# Метод iloc

In [6]:
df_data = pd.DataFrame([['Anna', 23, 3],
             ['Ivan', 36, 12],
             ['Lena', 33, 10],
             ['Irina', 25, 7],
             ['Lisa', 27, 7],
             ['Peter', 32, None]])
df_data.columns = ['name', 'age', 'expr']  
df_data

    name  age  expr
0   Anna   23   3.0
1   Ivan   36  12.0
2   Lena   33  10.0
3  Irina   25   7.0
4   Lisa   27   7.0
5  Peter   32   NaN

Для выбора строк и столбцов в Pandas есть два основных метода: .iloc и .loc. Первый используется для выбора строк и столбцов по их индексу, второй – по их названию. Внутри каждого из этих методов в квадратных скобках указывается сначала идентификатор (индекс или название) строки, а затем – идентификатор столбца. Попробуем выбрать элемент, который находится в строке с индексом 1 и в столбце с индексом 2:

In [7]:
df_data.iloc[1, 2]

12.0

В качестве индексов можно указывать числовые срезы (как обычно, правый конец отрезка не включается):

In [9]:
df_data.iloc[1:3, 1]

1    36
2    33
Name: age, dtype: int64

И полные срезы:

In [11]:
df_data.iloc[:, 0]

0     Anna
1     Ivan
2     Lena
3    Irina
4     Lisa
5    Peter
Name: name, dtype: object

In [12]:
df_data.iloc[1:3, :]

   name  age  expr
1  Ivan   36  12.0
2  Lena   33  10.0

# Метод apply

для примеров с apply создадим сводную таблицу

In [25]:
#cоздание сводной таблицы для реализации метода apply
df_pivot = df.pivot_table('adults', index='arrival_full_date', columns='meal', aggfunc = 'count').reset_index()
df_pivot

meal arrival_full_date     BB   FB    HB    SC  Undefined
0           2015-07-01   45.0  1.0  76.0   NaN        NaN
1           2015-07-02   83.0  1.0   9.0   NaN        NaN
2           2015-07-03   36.0  NaN  19.0   1.0        NaN
3           2015-07-04   76.0  1.0  11.0   NaN        NaN
4           2015-07-05   38.0  NaN  14.0   1.0        NaN
..                 ...    ...  ...   ...   ...        ...
788         2017-08-27  115.0  2.0  25.0  31.0        1.0
789         2017-08-28  101.0  3.0  99.0   8.0        NaN
790         2017-08-29   93.0  NaN  10.0  22.0        NaN
791         2017-08-30   69.0  NaN  12.0   7.0        1.0
792         2017-08-31   95.0  NaN  18.0  19.0        2.0

[793 rows x 6 columns]

Выберем в помощью .loc и текстового среза нужные столбцы и применим к ним функцию sum:

In [31]:
df_pivot['total'] = df_pivot.loc[:,'BB':'HB'].apply(np.sum, axis=1)
df_pivot.head(10)

meal arrival_full_date    BB   FB    HB   SC  Undefined  total
0           2015-07-01  45.0  1.0  76.0  NaN        NaN  122.0
1           2015-07-02  83.0  1.0   9.0  NaN        NaN   93.0
2           2015-07-03  36.0  NaN  19.0  1.0        NaN   55.0
3           2015-07-04  76.0  1.0  11.0  NaN        NaN   88.0
4           2015-07-05  38.0  NaN  14.0  1.0        NaN   52.0
5           2015-07-06  60.0  NaN  15.0  NaN        NaN   75.0
6           2015-07-07  41.0  NaN  11.0  2.0        NaN   52.0
7           2015-07-08  61.0  1.0   6.0  1.0        NaN   68.0
8           2015-07-09  74.0  NaN   6.0  NaN        NaN   80.0
9           2015-07-10  34.0  4.0  13.0  NaN        NaN   51.0

Если бы мы написали `axis=0`, то получили бы cумму броней по выбранным типам питания (три значения):

In [34]:
df_pivot.loc[:,'BB':'HB'].apply(np.sum, axis=0)

meal
BB    92310.0
FB      798.0
HB    14463.0
dtype: float64

In [36]:
#аналогичный результат получается таким образом
df_pivot.BB.sum()

92310.0

Самое интересное и полезное: в .apply() можно прописывать свои функции, которые мы заранее определим. Напишем функцию, которая будет считать размах: вычитать из максимального значения минимальное и возвращать результат. Напишем небольшую lambda-функцию в Python и назовём её f. Мы не обсуждали отдельно написание собственных функций, но lambda-функции устроены несложно. Сначала мы указываем название функции, потом после знака равенства начинаем её определять. Стартуем с ключевого слова lambda, чтобы Python понимал, что это функция. После указываем аргумент – то, с чем функция должна работать, то, что подаётся ей на вход. Назвать его мы можем как угодно, у нас будет x. Далее через двоеточие мы прописываем, что с этим x нужно сделать, то есть вернуть на выходе, в результате исполнения функции.

In [43]:
f = lambda x: x.max() - x.min()

Здесь `x` – это какой-то перечень значений. Применим написанную нами функцию к тем же столбцам и скажем, что опять функция должна применяться по строкам:

In [47]:
df_pivot['diff'] = df_pivot.loc[:,'BB':'SC'].apply(f, axis=1)
df_pivot

meal arrival_full_date     BB   FB    HB    SC  Undefined  total   mean   diff
0           2015-07-01   45.0  1.0  76.0   NaN        NaN  122.0   75.0   75.0
1           2015-07-02   83.0  1.0   9.0   NaN        NaN   93.0   82.0   82.0
2           2015-07-03   36.0  NaN  19.0   1.0        NaN   55.0   35.0   35.0
3           2015-07-04   76.0  1.0  11.0   NaN        NaN   88.0   75.0   75.0
4           2015-07-05   38.0  NaN  14.0   1.0        NaN   52.0   37.0   37.0
..                 ...    ...  ...   ...   ...        ...    ...    ...    ...
788         2017-08-27  115.0  2.0  25.0  31.0        1.0  142.0  114.0  113.0
789         2017-08-28  101.0  3.0  99.0   8.0        NaN  203.0   98.0   98.0
790         2017-08-29   93.0  NaN  10.0  22.0        NaN  103.0   83.0   83.0
791         2017-08-30   69.0  NaN  12.0   7.0        1.0   81.0   68.0   62.0
792         2017-08-31   95.0  NaN  18.0  19.0        2.0  113.0   93.0   77.0

[793 rows x 9 columns]

Мы получили в столбце diff разницу между максимальным и минимальным значением за день

# Подсчет значений (value_counts())

Функция value_counts() используется для получения Series , содержащего уникальные значения. Она вернет результат, отсортированный в порядке убывания, так что первый элемент в коллекции будет самым встречаемым. NA-значения не включены в результат

Важно заметить, что value_counts работает только с series, но не dataframe. Поэтому нужно указать одни квадратные скобки df['your_column'], а не пару df[['your_column']].

Параметры:

normalize (по умолчанию False) — если True, то возвращаемый объект будет содержать значения относительно частоты встречаемых значений.

sort (по умолчанию True) — сортировка по частоте.

ascending (по умолчанию False) — сортировка по возрастанию.

bins (int) — вместе подсчета значений группирует их по отрезкам, но это работает только с числовыми данными.

dropna (по умолчанию True) — не включать количество NaN.

In [48]:
#посчет значений
df['country'].value_counts() #или df.country.value_counts()

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
       ...
FJI        1
PLW        1
UMI        1
GUY        1
ASM        1
Name: country, Length: 177, dtype: int64

In [55]:
#normalize - подсчет частоты значений в процентах, dropna - включение/исключение ненулевых значений
df['country'].value_counts(normalize=True)

PRT    0.408656
GBR    0.102008
FRA    0.087593
ESP    0.072059
DEU    0.061286
         ...
FJI    0.000008
PLW    0.000008
UMI    0.000008
GUY    0.000008
ASM    0.000008
Name: country, Length: 177, dtype: float64






Как уже было отмечено, value_counts() возвращает Series, а не Dataframe. 
Если же нужно получить результаты в последнем виде, то для этого можно использовать функцию .to_frame() после .value_counts().

In [61]:
df['country'].value_counts().to_frame()

     country
PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
..       ...
FJI        1
PLW        1
UMI        1
GUY        1
ASM        1

[177 rows x 1 columns]

или второй способ

In [63]:
value_counts = df['country'].value_counts()

# преобразование в df и присвоение новых имен колонкам
df_value_counts = pd.DataFrame(value_counts)
df_value_counts = df_value_counts.reset_index()
df_value_counts.columns = ['country', 'count']
df_value_counts

    country  count
0       PRT  48590
1       GBR  12129
2       FRA  10415
3       ESP   8568
4       DEU   7287
..      ...    ...
172     FJI      1
173     PLW      1
174     UMI      1
175     GUY      1
176     ASM      1

[177 rows x 2 columns]

groupby и value_counts()

Groupby — очень популярный метод в Pandas. С его помощью можно сгруппировать результат по одной колонке и посчитать значения в другой.

df.groupby('your_column_1')['your_column_2'].value_counts()

In [65]:
df.groupby('hotel')['country'].value_counts()

hotel         country
City Hotel    PRT        30960
              FRA         8804
              DEU         6084
              GBR         5315
              ESP         4611
                         ...
Resort Hotel  TGO            1
              TUN            1
              UGA            1
              UZB            1
              ZMB            1
Name: country, Length: 291, dtype: int64

Это мульти-индекс, позволяющий иметь несколько уровней индексов в dataframe. В этом случае тип отеля соответствует нулевому уровню индекса, а страна — первому.

Фильтрация значений по минимум и максимум

Этот код отфильтрует все значения уникальных данных и покажет только те, где значение больше единицы.

In [67]:
df['country'].value_counts().loc[lambda x : x > 10]

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
       ...
BGD       12
ALB       12
MDV       12
PRI       12
SEN       11
Name: country, Length: 93, dtype: int64

In [ ]:
#Задание 1. Посчитать количество уникальных значений по столбцу reserved_room_type, 
#выбрать значения больше 1000 и передать данные в датафрейм

In [ ]:
#Задание 2. Тест - test_value_counts